; domain
(define 
	(domain merry)
	(:requirements :adl)
	(:predicates
		(pokoj ?x)
		(klucz ?klucz ?pokoj)
		(drzwi ?skad ?dokad ?kolor)
		(sasiaduje ?pole1 ?pole2)
		(bohater ?pokoj)
		(pozycja ?klocek ?pole)
		(wolne ?pole)	
		(plecak ?x)
	)
	
	(:action wez
		:parameters (?kolor ?skad)
		:precondition
		(and
			(pokoj ?skad)
			(bohater ?skad)
			(klucz ?kolor ?skad)
		)
		:effect
		(and
			(plecak ?kolor)
			(not (klucz ?kolor ?skad))
		)
	)
	
	(:action idz
		:parameters (?dokad ?skad ?kolor)
		:precondition
		(and
			(pokoj ?skad)
			(pokoj ?dokad)
			(bohater ?skad)
			(not(= ?skad ?dokad))
			(plecak ?kolor)
			(drzwi ?skad ?dokad ?kolor)
			
		)
		:effect
		(and
			(bohater ?dokad)
			(not (plecak ?kolor))
			(not (bohater ?skad))
		)
	)
	
	(:action przesun
		:parameters (?co ?skad ?gdzie)
		:precondition
		(and
			(bohater a)
			(wolne ?gdzie)
			(sasiaduje ?skad ?gdzie)
			(not (= ?skad ?gdzie))
			(pozycja ?co ?skad)
		)
		:effect
		(and
			(wolne ?skad)
			(not(wolne ?gdzie))
			(pozycja ?co ?gdzie)
			(not (pozycja ?co ?skad))
		)
	)
	
)

; problem
(define (problem merry1)
	(:domain merry)
	(:objects
		n1 n2 n3 n4 n5
		r1
		p1 p2
		z1 z2 z3 z4
		c1 c2
		a b c d e f g h i
		pu1 pu2 pu3 pu4 pu5 pu6 pu7 pu8 pu9
		pk1 pk2 pk3 pk4 pk5 pk6 pk7 pk8
	)
	(:init
		(pokoj a)
		(pokoj b)
		(pokoj c)
		(pokoj d)
		(pokoj e)
		(pokoj f)
		(pokoj g)
		(pokoj h)
		(pokoj i)
		
		(klucz n1 f)
		(klucz n2 f)
		(klucz n3 i)
		(klucz n4 e)
		(klucz n5 c)
		
		(klucz r1 b)

		(klucz p1 i)
		(klucz p2 c)
		
		(klucz z1 h)
		(klucz z2 e)
		(klucz z3 a)
		(klucz z4 d)
		
		(klucz c1 h)
		(klucz c2 d)
		
		(drzwi a b p1)
		(drzwi a b p2)
		
		(drzwi a c c1)
		(drzwi a c c2)
		
		(drzwi b d p1)
		(drzwi b d p2)
		
		(drzwi c a c1)
		(drzwi c a c2)
		(drzwi c e z1)
		(drzwi c e z2)
		(drzwi c e z3)
		(drzwi c e z4)
		
		(drzwi d f z1)
		(drzwi d f z2)
		(drzwi d f z3)
		(drzwi d f z4)
		
		(drzwi e c z1)
		(drzwi e c z2)
		(drzwi e c z3)
		(drzwi e c z4)
		(drzwi e f n1)
		(drzwi e f n2)
		(drzwi e f n3)
		(drzwi e f n4)
		(drzwi e f n5)
		(drzwi e h c1)
		(drzwi e h c2)
		
		(drzwi f g r1)
		(drzwi f d z1)
		(drzwi f d z2)
		(drzwi f d z3)
		(drzwi f d z4)
		(drzwi f e n1)
		(drzwi f e n2)
		(drzwi f e n3)
		(drzwi f e n4)
		(drzwi f e n5)
		(drzwi f i n1)
		(drzwi f i n2)
		(drzwi f i n3)
		(drzwi f i n4)
		(drzwi f i n5)
		
		(drzwi h e c1)
		(drzwi h e c2)
		(drzwi h i n1)
		(drzwi h i n2)
		(drzwi h i n3)
		(drzwi h i n4)
		(drzwi h i n5)
		
		(drzwi i f n1)
		(drzwi i f n2)
		(drzwi i f n3)
		(drzwi i f n4)
		(drzwi i f n5)
		(drzwi i h n1)
		(drzwi i h n2)
		(drzwi i h n3)
		(drzwi i h n4)
		(drzwi i h n5)
		
		(bohater f)
		
		(sasiaduje pu1 pu2)
		(sasiaduje pu1 pu4)
		(sasiaduje pu2 pu3)
		(sasiaduje pu2 pu1)
		(sasiaduje pu2 pu5)
		(sasiaduje pu3 pu2)
		(sasiaduje pu3 pu6)
		(sasiaduje pu4 pu1)
		(sasiaduje pu4 pu5)
		(sasiaduje pu4 pu7)
		(sasiaduje pu5 pu2)
		(sasiaduje pu5 pu4)
		(sasiaduje pu5 pu6)
		(sasiaduje pu5 pu8)
		(sasiaduje pu6 pu3)
		(sasiaduje pu6 pu5)
		(sasiaduje pu6 pu9)
		(sasiaduje pu7 pu4)
		(sasiaduje pu7 pu8)
		(sasiaduje pu8 pu5)
		(sasiaduje pu8 pu7)
		(sasiaduje pu8 pu9)
		(sasiaduje pu9 pu6)
		(sasiaduje pu9 pu8)
		
		(pozycja pk1 pu3)
		(pozycja pk2 pu8)
		(pozycja pk3 pu6)
		(pozycja pk4 pu2)
		(pozycja pk5 pu1)
		(pozycja pk6 pu9)
		(pozycja pk7 pu7)
		(pozycja pk8 pu4)
		(wolne pu5)
	)
	(:goal
		(and
			(pozycja pk1 pu1)
			(pozycja pk2 pu2)
			(pozycja pk3 pu3)
			(pozycja pk4 pu4)
			(pozycja pk5 pu5)
			(pozycja pk6 pu6)
			(pozycja pk7 pu7)
			(pozycja pk8 pu8)
			(bohater g)
		)
	)

)

; plan
1. (wez n1 f)
   deleted: (klucz n1 f)
   added: (plecak n1)
   goals met: 1 of 9
2. (idz e f n1)
   deleted: (plecak n1) (bohater f)
   added: (bohater e)
   goals met: 1 of 9
3. (wez n4 e)
   deleted: (klucz n4 e)
   added: (plecak n4)
   goals met: 1 of 9
4. (wez z2 e)
   deleted: (klucz z2 e)
   added: (plecak z2)
   goals met: 1 of 9
5. (idz f e n4)
   deleted: (plecak n4) (bohater e)
   added: (bohater f)
   goals met: 1 of 9
6. (wez n2 f)
   deleted: (klucz n2 f)
   added: (plecak n2)
   goals met: 1 of 9
7. (idz d f z2)
   deleted: (plecak z2) (bohater f)
   added: (bohater d)
   goals met: 1 of 9
8. (wez c2 d)
   deleted: (klucz c2 d)
   added: (plecak c2)
   goals met: 1 of 9
9. (wez z4 d)
   deleted: (klucz z4 d)
   added: (plecak z4)
   goals met: 1 of 9
10. (idz f d z4)
   deleted: (plecak z4) (bohater d)
   added: (bohater f)
   goals met: 1 of 9
11. (idz i f n2)
   deleted: (plecak n2) (bohater f)
   added: (bohater i)
   goals met: 1 of 9
12. (wez n3 i)
   deleted: (klucz n3 i)
   added: (plecak n3)
   goals met: 1 of 9
13. (wez p1 i)
   deleted: (klucz p1 i)
   added: (plecak p1)
   goals met: 1 of 9
14. (idz h i n3)
   deleted: (plecak n3) (bohater i)
   added: (bohater h)
   goals met: 1 of 9
15. (wez c1 h)
   deleted: (klucz c1 h)
   added: (plecak c1)
   goals met: 1 of 9
16. (wez z1 h)
   deleted: (klucz z1 h)
   added: (plecak z1)
   goals met: 1 of 9
17. (idz e h c1)
   deleted: (plecak c1) (bohater h)
   added: (bohater e)
   goals met: 1 of 9
18. (idz c e z1)
   deleted: (plecak z1) (bohater e)
   added: (bohater c)
   goals met: 1 of 9
19. (wez p2 c)
   deleted: (klucz p2 c)
   added: (plecak p2)
   goals met: 1 of 9
20. (idz a c c2)
   deleted: (plecak c2) (bohater c)
   added: (bohater a)
   goals met: 1 of 9
21. (wez z3 a)
   deleted: (klucz z3 a)
   added: (plecak z3)
   goals met: 1 of 9
22. (przesun pk2 pu8 pu5)
   deleted: (wolne pu5) (pozycja pk2 pu8)
   added: (wolne pu8) (pozycja pk2 pu5)
   goals met: 1 of 9
23. (przesun pk6 pu9 pu8)
   deleted: (wolne pu8) (pozycja pk6 pu9)
   added: (wolne pu9) (pozycja pk6 pu8)
   goals met: 1 of 9
24. (przesun pk3 pu6 pu9)
   deleted: (wolne pu9) (pozycja pk3 pu6)
   added: (wolne pu6) (pozycja pk3 pu9)
   goals met: 1 of 9
25. (przesun pk2 pu5 pu6)
   deleted: (wolne pu6) (pozycja pk2 pu5)
   added: (wolne pu5) (pozycja pk2 pu6)
   goals met: 1 of 9
26. (przesun pk8 pu4 pu5)
   deleted: (wolne pu5) (pozycja pk8 pu4)
   added: (wolne pu4) (pozycja pk8 pu5)
   goals met: 1 of 9
27. (przesun pk5 pu1 pu4)
   deleted: (wolne pu4) (pozycja pk5 pu1)
   added: (wolne pu1) (pozycja pk5 pu4)
   goals met: 1 of 9
28. (przesun pk4 pu2 pu1)
   deleted: (wolne pu1) (pozycja pk4 pu2)
   added: (wolne pu2) (pozycja pk4 pu1)
   goals met: 1 of 9
29. (przesun pk1 pu3 pu2)
   deleted: (wolne pu2) (pozycja pk1 pu3)
   added: (wolne pu3) (pozycja pk1 pu2)
   goals met: 1 of 9
30. (przesun pk2 pu6 pu3)
   deleted: (wolne pu3) (pozycja pk2 pu6)
   added: (wolne pu6) (pozycja pk2 pu3)
   goals met: 1 of 9
31. (przesun pk3 pu9 pu6)
   deleted: (wolne pu6) (pozycja pk3 pu9)
   added: (wolne pu9) (pozycja pk3 pu6)
   goals met: 1 of 9
32. (przesun pk6 pu8 pu9)
   deleted: (wolne pu9) (pozycja pk6 pu8)
   added: (wolne pu8) (pozycja pk6 pu9)
   goals met: 1 of 9
33. (przesun pk8 pu5 pu8)
   deleted: (wolne pu8) (pozycja pk8 pu5)
   added: (wolne pu5) (pozycja pk8 pu8)
   goals met: 2 of 9
34. (przesun pk5 pu4 pu5)
   deleted: (wolne pu5) (pozycja pk5 pu4)
   added: (wolne pu4) (pozycja pk5 pu5)
   goals met: 3 of 9
35. (przesun pk4 pu1 pu4)
   deleted: (wolne pu4) (pozycja pk4 pu1)
   added: (wolne pu1) (pozycja pk4 pu4)
   goals met: 4 of 9
36. (przesun pk1 pu2 pu1)
   deleted: (wolne pu1) (pozycja pk1 pu2)
   added: (wolne pu2) (pozycja pk1 pu1)
   goals met: 5 of 9
37. (przesun pk2 pu3 pu2)
   deleted: (wolne pu2) (pozycja pk2 pu3)
   added: (wolne pu3) (pozycja pk2 pu2)
   goals met: 6 of 9
38. (przesun pk3 pu6 pu3)
   deleted: (wolne pu3) (pozycja pk3 pu6)
   added: (wolne pu6) (pozycja pk3 pu3)
   goals met: 7 of 9
39. (przesun pk6 pu9 pu6)
   deleted: (wolne pu6) (pozycja pk6 pu9)
   added: (wolne pu9) (pozycja pk6 pu6)
   goals met: 8 of 9
40. (idz b a p1)
   deleted: (plecak p1) (bohater a)
   added: (bohater b)
   goals met: 8 of 9
41. (wez r1 b)
   deleted: (klucz r1 b)
   added: (plecak r1)
   goals met: 8 of 9
42. (idz d b p2)
   deleted: (plecak p2) (bohater b)
   added: (bohater d)
   goals met: 8 of 9
43. (idz f d z3)
   deleted: (plecak z3) (bohater d)
   added: (bohater f)
   goals met: 8 of 9
44. (idz g f r1)
   deleted: (plecak r1) (bohater f)
   added: (bohater g)
   goals met: 9 of 9
